; Определение констант по стандарту Cosmic (ИМЯ: equ ЗНАЧЕНИЕ)
CLK_CKDIVR:	equ	$50c6
CLK_PCKENR1:	equ	$50c7
CLK_PCKENR2:	equ	$50ca

; Переключение в сегмент (секцию) кода ROM по стандарту Cosmic
switch	.text

;-----------------------------------------------------------------------------
; Инициализация тактирования на 16 МГц
;-----------------------------------------------------------------------------
xdef	_clkInit
_clkInit:
	mov	CLK_CKDIVR, #$00
	ret

;-----------------------------------------------------------------------------
; Включение периферии первого блока
;-----------------------------------------------------------------------------
xdef	_clkPeripheralEnable
_clkPeripheralEnable:
	or	a, CLK_PCKENR1
	ld	CLK_PCKENR1, a
	ret

	end